{"intents":[
  { "tag": "saudacao",
    "patterns":["Ola","Opa","Oi", "tudo bem"],
    "responses": ["Oi","Olá"],
    "comentario": "saudação para o chatbot"
  },
  { "tag": "despedida",
    "patterns":["valeu","tchau","Obrigado","tks"],
    "responses": ["Até breve","Falou"],
    "comentario": "se despede do chatbot e desliga o chatbot"
  },
  { "tag": "introdução",  
    "patterns":["O que é o tcc?", "O que é o trabalho de conclusão de curso?"],
    "responses": ["O trabalho de final de curso tem como objetivo principal exercitar a capacidade dos estudantes em desenvolver uma solução para uma questão que envolva recursos computacionais e que utilize os conhecimentos acumulados durante o curso de graduação. A solução proposta deve ter como base o método científico"],
    "comentario": "explica o que é o tcc e os seus objetivos"
  },
  { "tag": "numero_grupo",
    "patterns":["Pode fazer grupo com mais pessoas?","Posso fazer grupo com menos pessoas?", "posso ter 5 integrantes?", "É permitido fazer grupo com mais de quatro integrantes?"],
    "responses": ["O TCC deve ser um trabalho de 4 pessoas. Caso tenha mais de 4 integrantes, a banca e o professor serão ambos mais exigentes. Ou seja, escolha por sua conta e risco"],
    "comentario": "Explica a quantidade de integrantes do tcc e as consequências de fazer o trabalho com mais ou menos integrantes"
  },
  { "tag": "entrega",
    "patterns":["O que deve ser entregue?","Qual a entrega?","O que preciso fazer?", "No que consiste a entrega do trabalho final?"],
    "responses": ["É esperado uma monografia e um artefato ou programa. A monografia deve: \n•Introduzir e apresentar os objetivos do trabalho\n•Conceituar o problema\n•revisar a literatura\n•desenvolver a arquitetura das técnicas utilizadas\n•discutir os resultados e conclusões finais. "]
  },
  { "tag": "orientador",
    "patterns":["O que o orientador deve fazer?", "Qual a responsabilidade do orientador?", "O que o orientador faz?", "Como o professor me ajudará?","Sim","y","Já" ],
    "responses": ["Cabe ao professor orientador:\n•Conduzir o trabalho e é recomendado pelo menos 1h semanal de reuniões com o grupo\n•Assegurar que os alunos estão cumprindo as atividades durante as aulas\n•Informar ao professor da disciplina possíveis desvios ou situações que merecem atenção ou que possam prejudicar o trabalho ou a convivência do grupo."]  },
  { "tag": "orientador-escolha",
    "patterns":["não","n","Ainda não.", "Não escolhi o orientador."],
    "responses": ["O professor orientador deve ser contatado com a maior antedecedência possível e pode ou não aceitar o projeto. Como regra geral, é ideal que se procure um professor que tem interesse na área do seu tema, mas não é preciso que seja do mesmo departamento."]  },
  { "tag": "professor",
  "patterns":["O que o professor deve fazer?", "Qual a responsabilidade do professor?", "O que o professor faz?", "Como o professor me ajudará?" ],
    "responses": ["Os professores da disciplina de tcc devem:\n•Apresentar semanalmente tópicos sobre metodologia científica e organização do trabalho\n•Acompanhar a evolução de cada grupo e auxiliar os alunos na condução das atividades\n•Validar as entregas no MOODLE\n•Informar ao professor orientador possíveis desvios ou situações que merecem atenção ou que possam prejudicar o trabalho ou a convivência do grupo."]
  },
  { "tag": "avaliação",
  "patterns":["Como será a avaliação?","Como a banca de tcc vai avaliar o meu trabalho?","Como meu tcc será avaliado?" ,"Quais são os critérios de avaliação?"],
    "responses": ["Os alunos tem dois semestres para desenvolver todas as atividades relacionadas ao trabalho, e ao final de cada semestre o trabalho será avaliado por uma banca de professores. \nA banca vai avaliar a monografia e a solução com base em um sistema de avaliação determinado e conhecido tanto pelos professores quanto pelos alunos.\nA avaliação é uma composição da avaliação da banca, do professor orientador e dos professores da disciplina de tcc.\nO orientador pode não enviar um trabalho pra banca baseado em seus critérios e justificativas de acordo com o professor de disciplina.\nO aluno será avaliado por sua contribuição efetiva no trabalho e tanto o orientador quanto o professor da disciplina podem aumentar ou reduzir as notas individuais dos alunos do grupo. O grupo também pode avaliar a participação individual de cada um e o professor da disciplina deve revisar essa avaliação, não necessariamente a considerando."]
  }
]
}